---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.flipFacing
zh: 族实例
source: html/66eb8785-4225-509c-b6a3-0bf9fe1612b2.htm
---
# Autodesk.Revit.DB.FamilyInstance.flipFacing Method

**中文**: 族实例

The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.

## Syntax (C#)
```csharp
public bool flipFacing()
```